system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices  
    (
      ( -12.0 0.0 0.0)
      ( 32.0 0.0 0.0)
      ( 32.0 4.0 0.0)
      ( -12.0 4.0 0.0)
      ( -12.0 0.0 6.4)
      ( 32.0 0.0 6.4)
      ( 32.0 4.0 6.4)
      ( -12.0 4.0 6.4)
    );
    
blocks  
( hex
      ( 0 1 2 3 4 5 6 7) ( 220 20 32) simpleGrading ( 1 1 1)
);

edges  
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    
    symmetryPlane
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }
    
    sideWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    
    topWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


mergePatchPairs  
(
);
